Autodesk.Revit.UI.Events.ViewActivatingEventArgs.CurrentActiveView
The view that is currently active.
Remarks:
May be null if there is no currently active view.

Autodesk.Revit.UI.Events.ViewActivatingEventArgs.NewActiveView
The view that is going to become active.

Autodesk.Revit.UI.Events.ViewActivatingEventArgs
The event arguments used by the ViewActivating event.